CreLab/stm32-gba-nds-cart-reader/src/nds_cart.c
void nds_cart_init(void)
{
    data_dir_input();
    clk_high();
    romcs_high();
    reset_high();
    eepromcs_high();
    MODIFY_REG(GPIOC->CRH, 0xFFFFu, 0x1111u);

    nds_cart_reset();
}

static void nds_cart_change_state(uint8_t state)
{
    if (state == NDS_CART_UNINITIALIZED)
    {
        nds_cart_reset();
    }
    else if (state == NDS_CART_RAW && nds_cart_state.state != NDS_CART_RAW)
    {
        nds_cart_rom_init();
        assert(nds_cart_state.state == NDS_CART_RAW);
    }
    else if (state == NDS_CART_KEY1 && nds_cart_state.state != NDS_CART_KEY1)
    {
        nds_cart_rom_init();
        nds_cart_begin_key1();
        assert(nds_cart_state.state == NDS_CART_KEY1);
    }
    else if (state == NDS_CART_KEY2 && nds_cart_state.state != NDS_CART_KEY2)
    {
        nds_cart_rom_init();
        nds_cart_begin_key1();
        nds_cart_begin_key2();
        assert(nds_cart_state.state == NDS_CART_KEY2);
    }
    else if (state == nds_cart_state.state)
    {
        return;
    }
    else
    {
        myassert(false, "switching to invalid state: 0x%x\r\n", (uint32_t) state);
    }
}

static void nds_cart_exec_command(uint64_t org_cmd, uint8_t *data, size_t len)
{
    assert(data != NULL);

    romcs_low();
    data_dir_output();

    bool clk_rate;
    bool gap_clk;
    bool key2_result;
    size_t gap1;
    size_t gap2;
    uint64_t cmd;

    if (nds_cart_state.state == NDS_CART_KEY1)
    {
        clk_rate = nds_cart_state.key1_clk_rate;
        gap_clk = nds_cart_state.key1_gap_clk;
        gap1 = nds_cart_state.key1_gap1 + nds_cart_state.key1_gap2;
        gap2 = nds_cart_state.key1_gap2;

        cmd = key1_encrypt_cmd(org_cmd);
        key2_result = true;
    }
    else
    {
        clk_rate = nds_cart_state.normal_clk_rate;
        gap_clk = nds_cart_state.normal_gap_clk;
        gap1 = nds_cart_state.normal_gap1 + nds_cart_state.normal_gap2;
        gap2 = nds_cart_state.normal_gap2;

        if (nds_cart_state.state == NDS_CART_KEY2)
        {
            cmd = key2_encrypt_cmd(&nds_cart_state, org_cmd);
            key2_result = true;
        }
        else
        {
            cmd = org_cmd;
            key2_result = false;
        }
    }

    const uint8_t cmd_data[8] = {
            (uint8_t) (cmd >> 56), (uint8_t) (cmd >> 48), (uint8_t) (cmd >> 40),
            (uint8_t) (cmd >> 32), (uint8_t) (cmd >> 24), (uint8_t) (cmd >> 16),
            (uint8_t) (cmd >> 8),  (uint8_t) (cmd >> 0),
    };

    if (clk_rate == NDS_CART_CLK_6P7_MHZ)
    {
        for (size_t i = 0; i < 8; i++)
        {
            data_out_cycle_67(cmd_data[i]);
        }
    }
    else
    {
        for (size_t i = 0; i < 8; i++)
        {
            data_out_cycle_42(cmd_data[i]);
        }
    }

    data_dir_input();

    if (gap_clk)
    {
        if (clk_rate == NDS_CART_CLK_6P7_MHZ)
        {
            for (size_t i = 0; i < gap1; i++)
                (void) data_in_cycle_67();
        }
        else
        {
            for (size_t i = 0; i < gap1; i++)
                (void) data_in_cycle_42();
        }

        if (key2_result)
            key2_xcrypt(&nds_cart_state, NULL, gap1);
    }
    else
    {
        WAIT(gap1 * 12);
    }

    if (len == 0)
        goto cmdend;

    while (true)
    {
        size_t block_size = len;
        if (block_size > NDS_CHUNK_SIZE)
            block_size = NDS_CHUNK_SIZE;

        if (clk_rate == NDS_CART_CLK_6P7_MHZ)
        {
            for (size_t i = 0; i < block_size; i++)
                data[i] = data_in_cycle_67();
        }
        else
        {
            for (size_t i = 0; i < block_size; i++)
                data[i] = data_in_cycle_42();
        }

        if (key2_result)
            key2_xcrypt(&nds_cart_state, data, block_size);

        data += block_size;
        len -= block_size;

        if (len == 0)
            break;

        if (gap_clk)
        {
            if (clk_rate == NDS_CART_CLK_6P7_MHZ)
            {
                for (size_t i = 0; i < gap2; i++)
                    (void) data_in_cycle_67();
            }
            else
            {
                for (size_t i = 0; i < gap2; i++)
                    (void) data_in_cycle_42();
            }

            if (key2_result)
                key2_xcrypt(&nds_cart_state, NULL, gap2);
        }
        else
        {
            WAIT(gap2 * 12);
        }
    }

cmdend:
    data_dir_input();
    romcs_high();
    WAIT(10);
}

static void nds_cart_cmd_dummy(void)
{
    const uint64_t cmd = 0x9F00000000000000;
    uint8_t dummy_data[0x2000];
    nds_cart_exec_command(cmd, dummy_data, sizeof(dummy_data));
}

static void nds_cart_rom_read_page(uint8_t *read_buffer, size_t page_addr)
{
    page_addr &= ~0xFFFu;

    if (page_addr == 0)
    {
        nds_cart_change_state(NDS_CART_RAW);
        if (nds_cart_state.dsi)
        {
            nds_cart_read_header(read_buffer, true);
            memset(&read_buffer[NDS_SMALL_HEADER_SIZE], 0, NDS_PAGE_SIZE - NDS_EXT_HEADER_SIZE);
        }
        else
        {
            nds_cart_read_header(read_buffer, false);
            memset(&read_buffer[NDS_SMALL_HEADER_SIZE], 0, NDS_PAGE_SIZE - NDS_SMALL_HEADER_SIZE);
        }
    }
    else if (page_addr < 0x4000)
    {
        memset(read_buffer, 0, NDS_PAGE_SIZE);
    }
    else if (page_addr < 0x8000)
    {
        if (nds_cart_state.has_secure_area)
        {
            nds_cart_change_state(NDS_CART_KEY1);
            nds_cart_read_secure_area_page(read_buffer, page_addr >> 12);
        }
        else
        {
            memset(read_buffer, 0, NDS_PAGE_SIZE);
        }
    }
    else
    {
        nds_cart_change_state(NDS_CART_KEY2);
        nds_cart_read_main_data_page(read_buffer, page_addr >> 12);
    }
}

void nds_cart_rom_read(size_t byte_addr, uint8_t *data, size_t len)
{
    uint8_t read_buffer[NDS_PAGE_SIZE];

    while (len > 0)
    {
        size_t page_addr = byte_addr & ~0xFFFu;
        size_t page_index = byte_addr & 0xFFFu;

        size_t read_len = NDS_PAGE_SIZE - page_index;
        if (read_len > len)
            read_len = len;

        nds_cart_rom_read_page(read_buffer, page_addr);
        memcpy(data, &read_buffer[page_index], read_len);
        byte_addr += read_len;
        len -= read_len;
        data += read_len;
    }
}

