CreLab/stm32-gba-nds-cart-reader/src/nds_cart.c
bool nds_cart_rom_init(void)
{
    nds_cart_reset();

    HAL_Delay(10);

    s_nds_chip_id chip_id;
    s_nds_header header;

    nds_cart_state.state = NDS_CART_RAW;

    nds_cart_cmd_dummy();
    nds_cart_read_header((uint8_t *) &header, false);
    nds_cart_cmd_chip_id((uint8_t *) &chip_id);

    nds_cart_state.chip_id = chip_id;
    nds_cart_state.protocol_rev = chip_id.cart_protocol;
    nds_cart_state.normal_gap_clk = header.gamecart_bus_timing_normal.clk_gap;
    nds_cart_state.normal_clk_rate = header.gamecart_bus_timing_normal.clk_rate;
    nds_cart_state.normal_gap1 = header.gamecart_bus_timing_normal.gap1_len;
    nds_cart_state.normal_gap2 = header.gamecart_bus_timing_normal.gap2_len;
    nds_cart_state.key1_gap_clk = chip_id.cart_protocol == 0 ? true : false;
    nds_cart_state.key1_clk_rate = header.gamecart_bus_timing_key1.clk_rate;
    nds_cart_state.key1_gap1 = header.gamecart_bus_timing_key1.gap1_len;
    nds_cart_state.key1_gap2 = header.gamecart_bus_timing_key1.gap2_len;
    nds_cart_state.key1_delay_ms = (uint16_t) ceil_div(header.secure_area_delay * 1000, 131072);

    if (header.unit_code == 0x0)
    {
        nds_cart_state.nds = true;
        nds_cart_state.dsi = false;
    }
    else if (header.unit_code == 0x2)
    {
        nds_cart_state.nds = true;
        nds_cart_state.dsi = true;
    }
    else if (header.unit_code == 0x3)
    {
        nds_cart_state.nds = false;
        nds_cart_state.dsi = true;
    }
    else
    {
        DEBUG_PRINTF("NDS cart: illegal unit code: %02x", header.unit_code);
        return false;
    }

    if (header.arm9_rom_offset >= 0x8000)
        nds_cart_state.has_secure_area = false;
    else
        nds_cart_state.has_secure_area = true;

    nds_cart_state.game_code = header.game_code_uint;
    nds_cart_state.secure_area_disable[0] = header.secure_area_disable_uint[0];
    nds_cart_state.secure_area_disable[1] = header.secure_area_disable_uint[1];
    nds_cart_state.seed_byte = header.encryption_seed_select;

    nds_cart_state.kkkkk = 0x98bc7;
    nds_cart_state.iii = 0x20C;
    nds_cart_state.jjj = 0xB5B;
    nds_cart_state.llll = 0xd44e;
    nds_cart_state.mmm = 0x733;
    nds_cart_state.nnn = 0xc55;
    nds_cart_state.key2 = key2_init(true);

    return true;
}

static void nds_cart_read_header(uint8_t *data, bool extended)
{
    assert(nds_cart_state.state == NDS_CART_RAW);

    uint64_t cmd = 0x0000000000000000;

    if (extended)
    {
        if (nds_cart_state.protocol_rev == NDS_PROTO_REV_1TROM_NAND)
        {
            for (size_t chunk = 0; chunk < NDS_EXT_HEADER_SIZE / NDS_CHUNK_SIZE; chunk++)
            {
                size_t chunk_addr = chunk * NDS_CHUNK_SIZE;
                cmd |= (uint64_t) chunk_addr << 24;
                nds_cart_exec_command(cmd, &data[chunk_addr], NDS_CHUNK_SIZE);
            }
        }
        else
        {
            nds_cart_exec_command(cmd, data, NDS_EXT_HEADER_SIZE);
        }
    }
    else
    {
        nds_cart_exec_command(cmd, data, NDS_SMALL_HEADER_SIZE);
        for (size_t i = NDS_SMALL_HEADER_SIZE; i < NDS_EXT_HEADER_SIZE; i++)
            data[i] = 0;
    }
}

void nds_cart_cmd_chip_id(uint8_t data[4])
{
    assert(nds_cart_state.state == NDS_CART_RAW);

    const uint64_t cmd = 0x9000000000000000;

    nds_cart_exec_command(cmd, data, 4);
}

static void nds_cart_cmd_main_data_read(uint8_t *data, uint32_t addr)
{
    uint64_t cmd = 0xB700000000000000;
    cmd |= ((uint64_t) addr & 0xFFFFFFFF) << 24;

    nds_cart_exec_command(cmd, data, NDS_CHUNK_SIZE);
}

static void nds_cart_cmd_enable_key1_nds(void)
{
    uint8_t reply[1];
    uint64_t cmd = 0x3C00000000000000;
    cmd |= (uint64_t) (nds_cart_state.iii & 0xFFF) << 44;
    cmd |= (uint64_t) (nds_cart_state.jjj & 0xFFF) << 32;
    cmd |= (uint64_t) (nds_cart_state.kkkkk & 0xFFFFF) << 8;
    nds_cart_exec_command(cmd, reply, 0);
}

static void nds_cart_cmd_enable_key2(void)
{
    assert(nds_cart_state.state == NDS_CART_KEY1);

    uint8_t reply[1];
    uint64_t cmd = 0x4000000000000000;
    cmd |= (uint64_t) (nds_cart_state.llll & 0xFFFF) << 44;
    cmd |= (uint64_t) (nds_cart_state.mmm & 0xFFF) << 32;
    cmd |= (uint64_t) (nds_cart_state.nnn & 0xFFF) << 20;
    cmd |= (uint64_t) (nds_cart_state.kkkkk & 0xFFFFF) << 0;

    assert(cmd == key1_decrypt_cmd(key1_encrypt_cmd(cmd)));

    if (nds_cart_state.protocol_rev == NDS_PROTO_REV_MROM)
    {
        HAL_Delay(nds_cart_state.key1_delay_ms);
        nds_cart_exec_command(cmd, reply, 0);
        nds_cart_state.key2 = key2_init(false);
    }
    else
    {
        nds_cart_exec_command(cmd, reply, 0);
        HAL_Delay(nds_cart_state.key1_delay_ms);
        nds_cart_state.key2 = key2_init(false);
        nds_cart_exec_command(cmd, reply, 0);
    }

    nds_cart_state.kkkkk += 1;
}

static void nds_cart_cmd_chip_id_key1(s_nds_chip_id *chip_id)
{
    assert(nds_cart_state.state == NDS_CART_KEY1);

    uint64_t cmd = 0x1000000000000000;
    cmd |= (uint64_t) (nds_cart_state.llll & 0xFFFF) << 44;
    cmd |= (uint64_t) (nds_cart_state.iii & 0xFFF) << 32;
    cmd |= (uint64_t) (nds_cart_state.jjj & 0xFFF) << 20;
    cmd |= (uint64_t) (nds_cart_state.kkkkk & 0xFFFFF) << 0;

    if (nds_cart_state.protocol_rev == NDS_PROTO_REV_MROM)
    {
        HAL_Delay(nds_cart_state.key1_delay_ms);
        nds_cart_exec_command(cmd, (uint8_t *) chip_id, sizeof(*chip_id));
    }
    else
    {
        nds_cart_exec_command(cmd, (uint8_t *) chip_id, 0);
        HAL_Delay(nds_cart_state.key1_delay_ms);
        nds_cart_exec_command(cmd, (uint8_t *) chip_id, sizeof(*chip_id));
    }

    nds_cart_state.kkkkk += 1;
}

static void nds_cart_cmd_get_secure_area(uint8_t *data, size_t page)
{
    assert(nds_cart_state.state == NDS_CART_KEY1);


    uint64_t cmd = 0x2000000000000000;
    cmd |= (uint64_t) (page & 0xFFFF) << 44;
    cmd |= (uint64_t) (nds_cart_state.iii & 0xFFF) << 32;
    cmd |= (uint64_t) (nds_cart_state.jjj & 0xFFF) << 20;
    cmd |= (uint64_t) (nds_cart_state.kkkkk & 0xFFFFF) << 0;

    if (nds_cart_state.protocol_rev == NDS_PROTO_REV_MROM)
    {
        HAL_Delay(nds_cart_state.key1_delay_ms);
        nds_cart_exec_command(cmd, data, NDS_PAGE_SIZE);
    }
    else
    {
        nds_cart_exec_command(cmd, data, 0);
        HAL_Delay(nds_cart_state.key1_delay_ms);
        for (size_t i = 0; i < NDS_PAGE_SIZE / NDS_CHUNK_SIZE; i++)
        {
            nds_cart_exec_command(cmd, data, NDS_CHUNK_SIZE);
            data += NDS_CHUNK_SIZE;
        }
    }

