CreLab/stm32-gba-nds-cart-reader/src/nds_cart.c
    nds_cart_state.kkkkk += 1;
}

static void nds_cart_cmd_enable_data_mode(void)
{
    assert(nds_cart_state.state == NDS_CART_KEY1);

    uint8_t reply[1];
    uint64_t cmd = 0xA000000000000000;
    cmd |= (uint64_t) (nds_cart_state.llll & 0xFFFF) << 44;
    cmd |= (uint64_t) (nds_cart_state.iii & 0xFFF) << 32;
    cmd |= (uint64_t) (nds_cart_state.jjj & 0xFFF) << 20;
    cmd |= (uint64_t) (nds_cart_state.kkkkk & 0xFFFFF) << 0;

    if (nds_cart_state.protocol_rev == NDS_PROTO_REV_MROM)
    {
        HAL_Delay(nds_cart_state.key1_delay_ms);
        nds_cart_exec_command(cmd, reply, 0);
    }
    else
    {
        nds_cart_exec_command(cmd, reply, 0);
        HAL_Delay(nds_cart_state.key1_delay_ms);
        nds_cart_exec_command(cmd, reply, 0);
    }

    nds_cart_state.kkkkk += 1;
}

static void nds_cart_cmd_chip_id_key2(s_nds_chip_id *chip_id)
{
    assert(nds_cart_state.state == NDS_CART_KEY2);

    const uint64_t cmd = 0xB800000000000000;
    nds_cart_exec_command(cmd, (uint8_t *) chip_id, sizeof(*chip_id));
}

static void nds_cart_read_main_data_page(uint8_t *data, size_t page)
{
    assert(nds_cart_state.state == NDS_CART_KEY2);

    for (size_t chunk = 0; chunk < NDS_PAGE_SIZE / NDS_CHUNK_SIZE; chunk++)
    {
        uint32_t addr = (page << 12) + chunk * NDS_CHUNK_SIZE;
        nds_cart_cmd_main_data_read(data, addr);
        data += NDS_CHUNK_SIZE;
    }
}

static void nds_cart_read_secure_area_page(uint8_t *data, size_t page)
{
    // TODO secure are delay
    assert(nds_cart_state.state == NDS_CART_KEY1);
    assert(page >= 4 && page <= 7);

    union
    {
        uint8_t _u8[NDS_PAGE_SIZE];
        uint32_t _u32[NDS_PAGE_SIZE / 4];
    } secure_area_page;

    nds_cart_cmd_get_secure_area(secure_area_page._u8, page);

    if (page == 4)
    {
        key1_decrypt_64bit(&secure_area_page._u32[0]);
        key1_init_keycode(nds_cart_state.game_code, 3, 8, false);
        const size_t SEC_AREA_KEY1_CRYPT_LEN = 0x800;
        for (size_t i = 0; i < SEC_AREA_KEY1_CRYPT_LEN / sizeof(uint32_t); i += 2)
            key1_decrypt_64bit(&secure_area_page._u32[i]);

        if (memcmp(secure_area_page._u8, "encryObj", 8))
        {
            DEBUG_PRINT("ERROR: secure area not correctly decrypted:");
            for (size_t i = 0; i < 8; i++)
                DEBUG_PRINTF(" %02x", secure_area_page._u8[i]);
            DEBUG_PRINT("\r\n");
        }
        else
        {
            secure_area_page._u32[0] = 0xE7FFDEFF;
            secure_area_page._u32[1] = 0xE7FFDEFF;
        }

        key1_init_keycode(nds_cart_state.game_code, 2, 8, false);
    }

    memcpy(data, secure_area_page._u8, sizeof(secure_area_page._u8));
}

static void nds_cart_reset(void)
{
    reset_low();
    HAL_Delay(10);
    reset_high();

    nds_cart_state.state = NDS_CART_UNINITIALIZED;
    nds_cart_state.normal_gap_clk = false;
    nds_cart_state.key1_gap_clk = false;
    nds_cart_state.normal_clk_rate = false;
    nds_cart_state.key1_clk_rate = false;
    nds_cart_state.nds = true;
    nds_cart_state.dsi = false;
    nds_cart_state.has_secure_area = true;
    nds_cart_state.normal_gap1 = 0x8F8;
    nds_cart_state.key1_gap1 = 0x8F8;
    nds_cart_state.normal_gap2 = 0x18;
    nds_cart_state.key1_gap2 = 0x18;
}

static void key1_encrypt_64bit(uint32_t *data)
{
    uint32_t y = data[0];
    uint32_t x = data[1];

    for (int i = 0; i <= 15; i++)
    {
        uint32_t z = blowfish_buf.P[i] ^ x;
        x = blowfish_buf.S[0][(z >> 24) & 0xFF];
        x = blowfish_buf.S[1][(z >> 16) & 0xFF] + x;
        x = blowfish_buf.S[2][(z >> 8) & 0xFF] ^ x;
        x = blowfish_buf.S[3][(z >> 0) & 0xFF] + x;
        x = y ^ x;
        y = z;
    }

    data[0] = x ^ blowfish_buf.P[16];
    data[1] = y ^ blowfish_buf.P[17];
}

static void key1_decrypt_64bit(uint32_t *data)
{
    uint32_t y = data[0];
    uint32_t x = data[1];

    for (int i = 17; i >= 2; i--)
    {
        uint32_t z = blowfish_buf.P[i] ^ x;
        x = blowfish_buf.S[0][(z >> 24) & 0xFF];
        x = blowfish_buf.S[1][(z >> 16) & 0xFF] + x;
        x = blowfish_buf.S[2][(z >> 8) & 0xFF] ^ x;
        x = blowfish_buf.S[3][(z >> 0) & 0xFF] + x;
        x = y ^ x;
        y = z;
    }

    data[0] = x ^ blowfish_buf.P[1];
    data[1] = y ^ blowfish_buf.P[0];
}

uint64_t key1_encrypt_cmd(uint64_t cmd)
{
    union
    {
        uint32_t _u32[2];
        uint64_t _u64;
    } u;

    u._u64 = cmd;
    key1_encrypt_64bit(u._u32);
    return u._u64;
}

uint64_t key1_decrypt_cmd(uint64_t cmd)
{
    union
    {
        uint32_t _u32[2];
        uint64_t _u64;
    } u;

    u._u64 = cmd;
    key1_decrypt_64bit(u._u32);
    return u._u64;
}

static void key1_apply_keycode(uint32_t *keycode, uint32_t modulo)
{
    uint32_t scratch[2];
    scratch[0] = scratch[1] = 0;

    key1_encrypt_64bit(&keycode[1]);
    key1_encrypt_64bit(&keycode[0]);

    for (uint32_t i = 0; i < 18; i++)
    {
        blowfish_buf.P[i] ^= __builtin_bswap32(keycode[i % (modulo / 4u)]);
    }

    for (uint32_t i = 0; i < 18; i += 2)
    {
        key1_encrypt_64bit(scratch);
        blowfish_buf.P[i + 0] = scratch[1];
        blowfish_buf.P[i + 1] = scratch[0];
    }

    for (uint32_t i = 0; i < 4; i++)
    {
        for (uint32_t j = 0; j < 256; j += 2)
        {
            key1_encrypt_64bit(scratch);
            blowfish_buf.S[i][j + 0] = scratch[1];
            blowfish_buf.S[i][j + 1] = scratch[0];
        }
    }
}

static void key1_init_keycode(uint32_t idcode, uint32_t level, uint32_t modulo, bool dsi)
{
    uint32_t keycode[3];

    if (dsi)
        memcpy(&blowfish_buf, dsi_cart_key, sizeof(blowfish_buf));
    else
        memcpy(&blowfish_buf, nds_cart_key, sizeof(blowfish_buf));

    keycode[0] = idcode;
    keycode[1] = idcode / 2;
    keycode[2] = idcode * 2;

    if (level >= 1)
        key1_apply_keycode(keycode, modulo);
    if (level >= 2)
        key1_apply_keycode(keycode, modulo);

    keycode[1] *= 2;
    keycode[2] /= 2;

    if (level >= 3)
        key1_apply_keycode(keycode, modulo);
}

