CreLab/stm32-gba-nds-cart-reader/src/nds_cart.c
s_key2 key2_init(bool hw_reset)
{
    s_key2 key = {0};

    uint64_t seed0 = 0x58C56DE0E8;
    uint64_t seed1 = 0x5C879B9B05;

    if (!hw_reset)
    {
        const uint64_t mmm = (uint64_t) (nds_cart_state.mmm & 0xFFF) << 27;
        const uint64_t nnn = (uint64_t) (nds_cart_state.nnn & 0xFFF) << 15;
        static const uint8_t seedbytes[8] = {0xE8, 0x4D, 0x5A, 0xB1, 0x17, 0x8F, 0x99, 0xD5};

        seed0 = (mmm | nnn) + 0x6000 + seedbytes[nds_cart_state.seed_byte % 8];
    }

    key.x = bitrev_64(seed0) >> (64 - 39);
    key.y = bitrev_64(seed1) >> (64 - 39);

    return key;
}

s_key2 key2_xcrypt(s_nds_cart_state* state, uint8_t *data, size_t len)
{
    s_key2 key = {0};
            
    uint64_t x = state->key2.x;
    uint64_t y = state->key2.y;

    if (data)
    {
        for (size_t i = 0; i < len; i++)
        {
            x = (((x >> 5) ^ (x >> 17) ^ (x >> 18) ^ (x >> 31)) & 0xFF) + (x << 8);
            x &= 0x7FFFFFFFFF;
            y = (((y >> 5) ^ (y >> 23) ^ (y >> 18) ^ (y >> 31)) & 0xFF) + (y << 8);
            y &= 0x7FFFFFFFFF;
            data[i] = (uint8_t) (data[i] ^ x ^ y);
        }
    }
    else
    {
        for (size_t i = 0; i < len; i++)
        {
            x = (((x >> 5) ^ (x >> 17) ^ (x >> 18) ^ (x >> 31)) & 0xFF) + (x << 8);
            x &= 0x7FFFFFFFFF;
            y = (((y >> 5) ^ (y >> 23) ^ (y >> 18) ^ (y >> 31)) & 0xFF) + (y << 8);
            y &= 0x7FFFFFFFFF;
        }
    }

    key.x = x;
    key.y = y;
    
    return key;
}

uint64_t key2_encrypt_cmd(s_nds_cart_state* state, uint64_t cmd)
{
    uint8_t cmd_data[8];

#pragma GCC unroll 8
    for (size_t i = 0; i < 8; i++)
    {
        cmd_data[i] = (uint8_t) (cmd >> 56);
        cmd <<= 8;
    }

    state->key2 = key2_xcrypt(state, cmd_data, sizeof(cmd_data));

    cmd = 0;
#pragma GCC unroll 8
    for (size_t i = 0; i < 8; i++)
    {
        cmd <<= 8;
        cmd |= cmd_data[i];
    }

    return cmd;
}
